<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.PDFsamBasic.x64.pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PDFsam Basic</string>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/PDFsamBasic-x64-pkgroot</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.PDFsamBasic.x64.install</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%pkgroot%</string>
                <key>pkgdirs</key>
                <array>
                    <string>Applications</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>/Applications/PDFsam Basic.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/PDFsam Basic.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
