Description: Downloads the latest release version of Azul Zulu JDK for a given version and architecture.
Identifier: com.github.emetriq.autopkg.pkg.zulu-jdk-yaml
ParentRecipe: com.github.emetriq.autopkg.download.zulu-jdk-yaml
MinimumVersion: 2.3.0

Input:
  NAME: ZuluJDK
  JAVA_VERSION: A valid major version like 8, 11 or 17
  JAVA_ARCH: A valid architecture like arm or x86

Process:
- Processor: com.github.homebysix.VersionSplitter/VersionSplitter
  Arguments:
    index: 0
    split_on: .dmg
    version: '%match%'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%.pkg'
    source_pkg: '%pathname%/Double-Click to Install Azul Zulu JDK %JAVA_VERSION%.pkg'