Description: Downloads the latest release version of Azul Zulu JDK for a given version and architecture.
Identifier: com.github.emetriq.autopkg.munki.zulu-jdk
ParentRecipe: com.github.emetriq.autopkg.pkg.zulu-jdk
MinimumVersion: 2.3.0

Input:
  NAME: ZuluJDK
  JAVA_VERSION: A valid major version like 8, 11 or 17
  JAVA_ARCH: A valid architecture like arm or x86
  MUNKI_DISPLAYNAME: Azul Zulu Open JDK %JAVA_VERSION% (%ARCHITECTURE%)
  MUNKI_DESCRIPTION: Java %JAVA_VERSION% (OpenJDK) for %ARCHITECTURE%
  MUNKI_CATEGORY: Developer Tools
  MUNKI_DEVELOPER: Azul Systems
  MUNKI_REPO_SUBDIR: %NAME%
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pkg_path%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Library: '0755'
      Library/Java: '0755'
      Library/Java/JavaVirtualMachines: '0755'
      Library/Java/JavaVirtualMachines/zulu-%JAVA_VERSION%.jdk: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-%JAVA_VERSION%.jdk'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/zulu-%JAVA_VERSION%.pkg/Payload'
    purge_destination: true

- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%/'
    installs_item_paths:
    - /Library/Java/JavaVirtualMachines/zulu-%JAVA_VERSION%.jdk
    version_comparison_key: CFBundleVersion

- Processor: MunkiPkginfoMerger

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-%JAVA_VERSION%.jdk/Contents/Info.plist'
    plist_keys:
      CFBundleVersion: version

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%/'
    - '%RECIPE_CACHE_DIR%/unpack/'