<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Docker Desktop.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.download.DockerDesktop</string>
    <key>Input</key>
    <dict>
        <key>DOCKER_ARCH</key>
        <string>A valid architecture like amd64 or arm64</string>
        <key>MUNKI_ARCHITECTURE</key>
        <string>A support macOS architecture: x86_64 or arm64</string>
        <key>NAME</key>
        <string>DockerDesktop-%MUNKI_ARCHITECTURE%</string>
        <key>url</key>
        <string>https://desktop.docker.com/mac/main/%DOCKER_ARCH%/Docker.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "com.docker.docker" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
