<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Brackets from Github.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.download.Brackets</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Brackets</string>
        <key>ASSET_REGEX</key>
        <string>Brackets\..*\.signed\.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>%ASSET_REGEX%</string>
                <key>github_repo</key>
                <string>brackets-cont/brackets</string>
                <key>include_prereleases</key>
                <false/>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "io.brackets.appshell" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8F632A866K"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
