<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports the latest release version of Azul Zulu JDK for a given version and architecture.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.download.zulu-jdk-v2</string>

    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ZuluJDK</string>
        <key>JAVA_VERSION</key>
        <string>A valid major version like 8, 11 or 17</string>
        <key>JAVA_ARCH</key>
        <string>A valid architecture like arm or x86</string>
    </dict>

    <key>MinimumVersion</key>
    <string>2.3.0</string>

    <key>Process</key>
    <array>

        <dict>
            <key>Processor</key>
            <string>ZuluJDKv2ReleaseProvider</string>
        </dict>

        <dict>
            <key>Arguments</key>
            <dict>
                <key>prefetch_filename</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>

        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Double*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>

</dict>
</plist>
