<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of JetBrains product.</string>
    <key>Identifier</key>
    <string>com.github.bnpl.autopkg.download.jetbrains</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JetBrainsProductDownload</string>
        <key>PROD_CODE</key>
        <string>A valid product code can be obtained from https://data.services.jetbrains.com/products</string>
        <key>CPU_TYPE</key>
        <string>mac for Intel based machines, macM1 for Apple Silicon based machines</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://data.services.jetbrains.com/products/releases?code=%PROD_CODE%&amp;latest=true&amp;type=release</string>
                <key>re_pattern</key>
                <string>"%CPU_TYPE%":{"link":"(https://download.jetbrains.com/.*?.dmg)"</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10.11; rv:46.0) Gecko/20100101 Firefox/46.0</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%pathname%/*.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pathname%/%dmg_found_filename%</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>min_os_vers</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%dmg_found_filename%</string>
                <key>requirement</key>
                <string>%CSV_REQ%</string>
                <key>strict_verification</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
