<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Slack and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.emetriq.autopkg.munki.Slack</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Slack</string>
		<key>NAME</key>
		<string>Slack</string>
        <key>SOFTWARETITLE</key>
        <string>Slack</string>
		<key>PROCESSORTYPE</key>
		<string>Universal</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
			<key>developer</key>
			<string>Slack</string>
			<key>display_name</key>
			<string>Slack</string>
			<key>minimum_os_version</key>
			<string>10.7</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.SlackUniversal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
