<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of RancherDesktop from Github.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.download.RancherDesktop</string>
    <key>Input</key>
    <dict>
        <key>RANCHER_ARCH</key>
        <string>A valid rancher architecture: x86_64 or aarch64</string>
        <key>MUNKI_ARCHITECTURE</key>
        <string>A support macOS architecture: x86_64 or arm64</string>
        <key>NAME</key>
        <string>Rancher Desktop %MUNKI_ARCHITECTURE%</string>
        <key>ASSET_REGEX</key>
        <string>Rancher\.Desktop-.*\.%RANCHER_ARCH%\.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>%ASSET_REGEX%</string>
                <key>github_repo</key>
                <string>rancher-sandbox/rancher-desktop</string>
                <key>include_prereleases</key>
                <false/>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "io.rancherdesktop.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2Q6FHJR3H3"</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
