<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of Rancher Desktop and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.munki.RancherDesktop</string>
    <key>Input</key>
    <dict>
        <key>RANCHER_ARCH</key>
        <string>A valid rancher architecture: x86_64 or aarch64</string>
        <key>MUNKI_ARCHITECTURE</key>
        <string>A support macOS architecture: x86_64 or arm64</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Rancher Desktop %MUNKI_ARCHITECTURE%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Container Management and Kubernetes on the Desktop (%MUNKI_ARCHITECTURE%)</string>
            <key>developer</key>
            <string>SUSE Rancher Engineering group</string>
            <key>display_name</key>
            <string>Rancher Desktop %MUNKI_ARCHITECTURE%</string>
            <key>supported_architectures</key>
            <array>
                <string>%MUNKI_ARCHITECTURE%</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>uninstall_method</key>
            <string>remove_copied_items</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.download.RancherDesktop</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
