<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of AnyDesk and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.munki.anydesk</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>AnyDesk</string>
        <key>MUNKI_CATEGORY</key>
        <string>RDP</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>AnyDesk ist eine Fernwartungssoftware</string>
            <key>developer</key>
            <string>AnyDesk Software GmbH</string>
            <key>display_name</key>
            <string>AnyDesk</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>uninstall_method</key>
            <string>remove_copied_items</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.download.anydesk</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
