<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Sync Munki catalogs to S3 if any other recipe in the same autopkg run imported something.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.munkis3sync</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiS3SyncProcessor</string>
        </dict>
    </array>
</dict>
</plist>
