<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of FileZilla and creates a package for Intel x86 Macs.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.FileZilla-intel.pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.FileZilla-intel.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
