<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Importiert das Apple-Silicon-PKG in dein Munki-Repo.</string>

	<key>Identifier</key>
	<string>com.github.emetriq.autopkg.FileZilla-arm64.munki</string>

	<key>Input</key>
	<dict/>

	<key>ParentRecipe</key>
	<string>com.github.emetriq.autopkg.FileZilla-arm64.pkg</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>  <string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>          <string>%pkg_path%</string>
				<key>repo_subdirectory</key> <string>apps/FileZilla</string>
				<key>catalogs</key>          <array><string>testing</string></array>

				<!-- Richtiger Container für zusätzliche PKG-Info -->
				<key>pkginfo</key>
				<dict>
					<key>description</key>       <string>FileZilla ist ein freier FTP-, FTPS- und SFTP-Client.</string>
					<key>display_name</key>      <string>FileZilla</string>
					<key>unattended_install</key><true/>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>