<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Importiert das Intel-PKG in dein Munki-Repo.</string>

	<key>Identifier</key>
	<string>com.github.emetriq.autopkg.FileZilla-intel.munki</string>

	<key>ParentRecipe</key>
	<string>com.github.emetriq.autopkg.FileZilla-intel.pkg</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>               <string>FileZilla</string>
		<key>MUNKI_REPO_SUBDIR</key>  <string>apps/FileZilla</string>
		<key>catalogs</key>           <array><string>testing</string></array>
		<key>description</key>        <string>FileZilla ist ein freier FTP-, FTPS- und SFTP-Client.</string>
		<key>display_name</key>       <string>FileZilla</string>
		<key>unattended_install</key> <true/>
	</dict>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>  <string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>          <string>%pkg_path%</string>
				<key>repo_subdirectory</key> <string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>