<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>local.munki.FileZilla-intel.download</string>

    <key>Description</key>
    <string>Downloads the latest FileZilla.app for Intel Macs (x86_64) and
exposes %version%.</string>

    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
    </dict>

    <key>Process</key>
    <array>

        <!-- 1) Direkt-URL aus der Downloadseite herausparsen -->
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://filezilla-project.org/download.php?show_all=1</string>
                <key>re_pattern</key>
                <string>(https?://[^"&apos;]+FileZilla_[0-9\.]+_macosx-x86\.app\.tar\.bz2)</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
            </dict>
        </dict>

        <!-- 2) Archiv herunterladen -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%-intel.tar.bz2</string>
            </dict>
        </dict>

        <!-- 3) Check-Phase beenden -->
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>

        <!-- 4) Entpacken -->
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
                <key>archive_format</key>
                <string>tar_bzip2</string>
            </dict>
        </dict>

        <!-- 5) Version lesen -->
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <array>
                    <string>CFBundleShortVersionString</string>
                </array>
            </dict>
        </dict>

    </array>
</dict>
</plist>