<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.pkg</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.download</string>
    <key>Description</key>
    <string>Erstellt ein PKG für FileZilla.app (arm64).</string>
    <key>Input</key>
    <dict>
        <key>pkg_request</key>
        <dict>
            <key>payload</key>
            <array>
                <dict>
                    <key>source</key>
                    <string>%RECIPE_CACHE_DIR%/FileZilla/FileZilla.app</string>
                    <key>destination</key>
                    <string>/Applications/FileZilla.app</string>
                </dict>
            </array>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <string>%pkg_request%</string>
                <key>pkg_name</key>
                <string>FileZilla-arm64.pkg</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
