<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Lädt FileZilla (Intel) &amp; installiert es nach /Applications.</string>

	<key>Identifier</key>
	<string>com.github.emetriq.autopkg.FileZilla-intel.install</string>

	<!-- Eingefügter Platzhalter -->
	<key>Input</key>
	<dict/>

	<key>ParentRecipe</key>
	<string>com.github.emetriq.autopkg.FileZilla-intel.download</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>  <string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>      <string>%RECIPE_CACHE_DIR%/FileZilla</string>
				<key>dmg_path</key>         <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>  <string>InstallFromDMG</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key> <string>%dmg_path%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>source_item</key>      <string>FileZilla.app</string>
						<key>destination_path</key><string>/Applications/</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>