<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>local.munki.FileZilla-arm64.download</string>

    <key>Description</key>
    <string>Downloads the latest FileZilla.app for Apple Silicon (ARM64)
from filezilla-project.org and exposes %version%.</string>

    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
    </dict>

    <key>Process</key>
    <array>

        <!-- 1) Link aus der „show_all“-Seite parsen -->
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://filezilla-project.org/download.php?show_all=1</string>
                <key>re_pattern</key>
                <string>
                    <![CDATA[
                    href="(?P<url>https://[^"]*
                          (?P<filename>FileZilla_(?P<version>[0-9\.]+)_macosx-arm64\.app\.tar\.bz2[^"]*))
                    ]]>
                </string>
            </dict>
        </dict>

        <!-- 2) Archiv herunterladen -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%filename%</string>
            </dict>
        </dict>

        <!-- 3) Check-Phase sauber beenden -->
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>

        <!-- 4) Entpacken (explizit tar_bzip2) -->
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
                <key>archive_format</key>
                <string>tar_bzip2</string>
            </dict>
        </dict>

        <!-- 5) Version aus Info.plist auslesen -->
        <dict>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <array>
                    <string>CFBundleShortVersionString</string>
                </array>
            </dict>
        </dict>

    </array>
</dict>
</plist>