<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.munki</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.download</string>
    <key>Description</key>
    <string>Munki import for FileZilla.app (Universal/arm64).</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/FileZilla</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/FileZilla/FileZilla.app</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munki_importer_pkginfo</key>
                <dict>
                    <key>name</key>
                    <string>FileZilla</string>
                    <key>display_name</key>
                    <string>FileZilla</string>
                    <key>description</key>
                    <string>FileZilla FTP Client für macOS (arm64)</string>
                    <key>minimum_os_version</key>
                    <string>11.0</string>
                    <key>developer</key>
                    <string>Tim Kosse</string>
                    <key>identifier</key>
                    <string>org.filezilla-project.filezilla</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
