<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Paketiert FileZilla (arm64) als .pkg für Verteilung.</string>

	<key>Identifier</key>
	<string>com.github.emetriq.autopkg.FileZilla-arm64.pkg</string>

	<key>ParentRecipe</key>
	<string>com.github.emetriq.autopkg.FileZilla-arm64.download</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>  <string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key> <string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key> <string>0775</string>
				</dict>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>  <string>CopyPath</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>      <string>%RECIPE_CACHE_DIR%/FileZilla/FileZilla.app</string>
				<key>destination_path</key><string>%pkgroot%/Applications/FileZilla.app</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>  <string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<string>pkgname FileZilla-%version%-%ARCHITECTURE%.pkg</string>
				<key>pkgdir</key>   <string>%RECIPE_CACHE_DIR%</string>
				<key>id</key>       <string>org.filezilla-project.filezilla</string>
				<key>version</key>  <string>%version%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>