<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the latest version of FileZilla for macOS ARM64.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.install</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app</string>
                <key>destination_path</key>
                <string>/Applications/FileZilla.app</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
