<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.install</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.FileZilla-arm64.download</string>
    <key>Description</key>
    <string>Installs FileZilla.app (Universal/arm64) to /Applications.</string>
    <key>Input</key>
    <dict/>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/FileZilla/FileZilla.app</string>
                <key>destination_path</key>
                <string>/Applications/FileZilla.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
