<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of FUSE-T from GitHub.</string>
	<key>Identifier</key>
	<string>com.github.emetriq.autopkg.download.FUSE-T</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FUSE-T</string>
		<key>ASSET_REGEX</key>
		<string>fuse-t-macos-installer-[0-9.]+\.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%ASSET_REGEX%</string>
				<key>github_repo</key>
				<string>macos-fuse-t/fuse-t</string>
				<key>include_prereleases</key>
				<false/>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
