<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft Visual Studio Code.</string>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.download.VisualStudioCode</string>
    <key>Input</key>
    <dict>
	<key>NAME</key>
	<string>VisualStudioCode</string>
	<!-- DOWNLOAD_ARCH needs to be "-arm64" for Apple Silicon. Can also be "-universal" -->
	<key>DOWNLOAD_ARCH</key>
        <string>-arm64</string>
        <key>url</key>
        <string>https://code.visualstudio.com/sha/download?build=stable&amp;os=darwin%DOWNLOAD_ARCH%-dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
            	<key>filename</key>
		<string>%NAME%.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
                <key>requirement</key>
                <string>identifier "com.microsoft.VSCode" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
