<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.Vivaldi.install</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.Vivaldi.pkg</string>
    <key>Description</key>
    <string>Installiert Vivaldi direkt nach dem Build.</string>
    <key>Input</key>
    <dict>
        <key>PKG_PATH</key>
        <string>%pkg_path%</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgInstaller</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%PKG_PATH%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
