<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.Vivaldi.pkg</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.Vivaldi.download</string>
    <key>Description</key>
    <string>Erstellt ein PKG-Installationspaket für Vivaldi.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Vivaldi</string>
        <key>APP_PATH</key>
        <string>Vivaldi.app</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>apps</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>%APP_PATH%</string>
                        </dict>
                    </array>
                    <key>version</key>
                    <string>%version%</string>
                    <key>pkgname</key>
                    <string>Vivaldi-%version%.pkg</string>
                </dict>
                <key>source_dmg</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
