<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.Vivaldi.munki</string>
    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.Vivaldi.pkg</string>
    <key>Description</key>
    <string>Importiert das Vivaldi-Paket in Munki.</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Vivaldi</string>
        <key>NAME</key>
        <string>Vivaldi</string>
        <key>pkg_path</key>
        <string>%pkg_path%</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munki_import_name</key>
                <string>%NAME%</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
