<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
        "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Importiert Vivaldi in das Munki-Repository.</string>

    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.Vivaldi.munki</string>

    <key>ParentRecipe</key>
    <string>com.github.emetriq.autopkg.Vivaldi.pkg</string>

    <!-- ---------- Eingaben ---------- -->
    <key>Input</key>
    <dict>
        <key>NAME</key><string>Vivaldi</string>
        <key>MUNKI_REPO_SUBDIR</key><string>apps/browsers</string>
        <key>catalogs</key>
        <array>
            <string>testing</string>
        </array>

        <!-- NEU: Anzeige- und Beschreibungstext -->
        <key>display_name</key><string>Vivaldi Browser</string>
        <key>description</key>
        <string>Vivaldi ist ein schneller, hochgradig anpassbarer und datenschutz­freundlicher Webbrowser.</string>
    </dict>

    <!-- ---------- Prozess-Schritte ---------- -->
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key><string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key><string>%pkg_path%</string>
                <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
                <key>catalogs</key><array><string>%catalogs%</string></array>

                <!-- NEU: pkginfo-Daten für Munki -->
                <key>pkginfo</key>
                <dict>
                    <key>display_name</key><string>%display_name%</string>
                    <key>description</key><string>%description%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
