<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Builds a relocatable pkg from the downloaded Vivaldi.app.</string>

  <key>Identifier</key>
  <string>com.github.emetriq.autopkg.vivaldi.pkg</string>

  <key>Input</key>
  <dict>
    <key>NAME</key><string>Vivaldi</string>
    <key>PKG_ID</key><string>com.vivaldi.Vivaldi</string>
  </dict>

  <key>ParentRecipe</key>
  <string>com.github.emetriq.autopkg.vivaldi.download</string>

  <key>Process</key>
  <array>

    <!-- erzeugt ein Arbeits-Pkg-Root -->
    <dict>
      <key>Processor</key><string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key><string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>pkgdirs</key>
        <dict><key>Applications</key><string>0775</string></dict>
      </dict>
    </dict>

    <!-- entpackt DMG → .app -->
    <dict>
      <key>Processor</key><string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key><string>%pathname%</string>
        <key>destination_path</key><string>%pkgroot%/Applications/</string>
        <key>purge_destination</key><true/>
      </dict>
    </dict>

    <!-- ermittelt Version aus Info.plist -->
    <dict>
      <key>Processor</key><string>Versioner</string>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%pkgroot%/Applications/Vivaldi.app/Contents/Info.plist</string>
        <key>plist_version_key</key><string>CFBundleShortVersionString</string>
      </dict>
    </dict>

    <!-- erstellt eigentliche .pkg -->
    <dict>
      <key>Processor</key><string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_request</key>
        <dict>
          <key>pkgname</key><string>%NAME%-%version%</string>
          <key>pkgdir</key><string>%RECIPE_CACHE_DIR%</string>
          <key>id</key><string>%PKG_ID%</string>
          <key>options</key><string>purge_ds_store</string>
          <key>chown</key>
          <array>
            <dict><key>path</key><string>Applications</string>
              <key>user</key><string>root</string>
              <key>group</key><string>admin</string></dict>
          </array>
        </dict>
      </dict>
    </dict>

  </array>
</dict>
</plist>