<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.emetriq.autopkg.Vivaldi.download</string>
    <key>Description</key>
    <string>Lädt die aktuelle Vivaldi macOS App herunter.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Vivaldi</string>
        <key>DOWNLOAD_URL</key>
        <string>https://downloads.vivaldi.com/stable/Vivaldi.dmg</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>Vivaldi.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>app_path</key>
                <string>Vivaldi.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
