<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest universal build of the Vivaldi browser for macOS.</string>
  <key>Identifier</key>
  <string>com.github.emetriq.autopkg.vivaldi.download</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Vivaldi</string>
    <key>DOWNLOAD_PAGE</key>
    <string>https://vivaldi.com/download/</string>
    <key>SEARCH_PATTERN</key>
    <string>https://downloads\.vivaldi\.com/stable/Vivaldi[0-9\.]+universal\.dmg</string>
  </dict>
  <key>MinimumVersion</key>
  <string>2.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_PAGE%</string>
        <key>re_pattern</key>
        <string>%SEARCH_PATTERN%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%match%</string>
        <key>filename</key>
        <string>%NAME%.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
  </array>
</dict>
</plist>