<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Builds a relocatable pkg from the downloaded Vivaldi.app.</string>
  <key>Identifier</key>
  <string>com.github.emetriq.autopkg.vivaldi.pkg</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Vivaldi</string>
    <key>PKG_ID</key>
    <string>com.vivaldi.Vivaldi</string>
  </dict>
  <key>ParentRecipe</key>
  <string>com.github.emetriq.autopkg.vivaldi.download</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>AppPkgCreator</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_path</key>
        <string>%pathname%</string>
        <key>pkg_name</key>
        <string>%NAME%-%version%</string>
        <key>pkg_id</key>
        <string>%PKG_ID%</string>
        <key>destination_path</key>
        <string>Applications</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>